snlkuharlocal/src/Catalogs/ТорговоеОборудование/ТорговоеОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТорговоеОборудование</name>
  <attributes>
    <name>ВидТорговогоОборудования</name>
    <type>
      <types>EnumRef.ВидыТорговогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяКомпонента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаОбслуживания</name>
    <type>
      <types>EnumRef.ОбработкиТорговогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммныйИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ККМДлинаНаименованияТовара</name>
    <comment>Длина наименования товара в ККМ</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ККМКонтролироватьЗаполнениеШтрихКода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаОбслуживания83</name>
    <type>
      <types>CatalogRef.ОбработкиОбслуживанияТО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДрайверОборудования</name>
    <type>
      <types>CatalogRef.ДрайверыОборудования</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ККМТипыШтрихкодов</name>
    <attributes>
      <name>ТипШтрихкода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/InformationRegisters/ТорговоеОборудование/ТорговоеОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТорговоеОборудование</name>
  <resources>
    <name>Подключено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Параметры</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Компьютер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МодельТорговогоОборудования</name>
    <type>
      <types>CatalogRef.ТорговоеОборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЛогическогоУстройства</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Catalogs/ТорговоеОборудование/ManagerModule.bsl
Функция ПолучитьПараметрыУстройства(Оборудование, ИмяКомпьютера) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ	
	|	КассаККМ,
	|	Параметры
	|ИЗ
	|	РегистрСведений.ТорговоеОборудование 
	|ГДЕ
	|	Компьютер = &Компьютер
	|	И Подключено
	|	И МодельТорговогоОборудования = &МодельТорговогоОборудования	
	|";
	
	Запрос.УстановитьПараметр("МодельТорговогоОборудования",	Оборудование);
	Запрос.УстановитьПараметр("Компьютер", 						Врег(СокрЛП(ИмяКомпьютера)));
	
	Результат = Неопределено;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если НЕ ПустаяСтрока(Выборка.Параметры) Тогда		
			Результат = ЗначениеИзСтрокиВнутр(Выборка.Параметры);
		КонецЕсли;
		
		Если Результат = Неопределено Тогда
			Результат = Новый Структура;
		КонецЕсли;		
	КонецЕсли; 	
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Результат = Новый Структура;	
	КонецЕсли; 
	
	Возврат Результат;	
КонецФункции

Функция СохранитьПараметрыУстройства(Оборудование, Параметры, КассаККМ, ИмяКомпьютера, Подключено) Экспорт

	Попытка		
		Запись = РегистрыСведений.ТорговоеОборудование.СоздатьМенеджерЗаписи();
		
		Запись.МодельТорговогоОборудования = Оборудование;
		Запись.Компьютер	= Врег(СокрЛП(ИмяКомпьютера));
		Запись.КассаККМ	    = КассаККМ;
		Запись.НомерЛогическогоУстройства = 1;
		Запись.Подключено	= Подключено;
		
		Запись.Параметры	= ЗначениеВСтрокуВнутр(Параметры);
		
		Запись.Записать();
			
		Результат = Истина;
			
		ОбновитьПовторноИспользуемыеЗначения();
	Исключение
		Результат = Ложь;
	КонецПопытки;
	
	Возврат Результат;

КонецФункции

Функция ПолучитьКассуПоОборудованию(Оборудование, ИмяКомпьютера) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ	
	|	КассаККМ	
	|ИЗ
	|	РегистрСведений.ТорговоеОборудование 
	|ГДЕ
	|	Компьютер = &Компьютер
	|	И Подключено
	|	И МодельТорговогоОборудования = &МодельТорговогоОборудования
	|";
	
	Запрос.УстановитьПараметр("МодельТорговогоОборудования",	Оборудование);
	Запрос.УстановитьПараметр("Компьютер", 						Врег(СокрЛП(ИмяКомпьютера())));
	
	Результат = Справочники.Кассы.ПустаяСсылка();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.КассаККМ) Тогда		
		Результат = Выборка.КассаККМ;
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции
